#!/bin/bash
# Шестнадцатеричный - десятичный - двоичный - ASCII код

function aschar () {
  # Функция для преобразования десятичного чисела в символ ASCII
  local ashex
  printf -v ashex '\\x%02x' $1
  printf '%b' $ashex
}

aschar 65
# Вывод: A

# Преобразование символа ASCII в десятичное число
printf '%d' "\"A"
# Вывод: 65

# Преобразование шестнадцатеричного числа в десятичное
printf "%d" 0x41
# Вывод: 65

# Преобразование десятичного числа обратно в шестнадцатеричное
printf "%x" 65
# Вывод: 41

# Чтобы преобразовать из ASCII в шестнадцатеричный формат
printf 'A' | xxd
# Вывод: 00000000: 41
echo -n 'A' | xxd
# Вывод: 00000000: 41
echo 'A' | xxd
# Вывод: 00000000: 410a  (символ переноса строки: 0a)

# Для преобразования шестнадцатеричного кода в ASCII
printf 0x41 | xxd -r
# Вывод: A

# Чтобы преобразовать из ASCII в двоичный код
printf 'A' | xxd -b
# Вывод: 00000000: 01000001





