#!/bin/bash
# $> ./blood_pressure_who.sh
# Артериальное давление, ВОЗ

cat << EOF
+---+-----------------------------------+-----------------------------+----------------------------+
| № | Артериальное давление (категория) | Верхнее давление, мм.рт.ст. | Нижнее давление, мм.рт.ст. |
+---+-----------------------------------+-----------------------------+----------------------------+
| 1 |      Гипотония (пониженное)       |          ниже 100           |          ниже 60           |
| 2 |       Оптимальное дваление        |          100 - 119          |          60 - 79           |
| 3 |       Нормальное давление         |          120 - 129          |          80 - 84           |
| 4 |    Высокое нормальное давление    |          130 - 139          |          85 - 89           |
| 5 |   Умеренная гипертония (мягкая)   |          140 - 159          |          90 - 99           |
| 6 |    Гипертония средней тяжести     |          160 - 179          |          100 - 109         |
| 7 |        Тяжелая гипертония         |          более 180          |          более 110         |
+---+-----------------------------------+-----------------------------+----------------------------+
EOF
