#!/bin/bash
# $> ./blood_pressure_who.sh
# Артериальное давление, ВОЗ

function color() {
  n="\033[0m"
  r="\033[31m"
  g="\033[32m"
  y="\033[33m"
  m="\033[35m"
  c="\033[36m"
  w="\033[37m"

  echo -e "
  "$c"+---+-----------------------------------+-----------------------------+----------------------------+
  "$w"| № | Артериальное давление (категория) | Верхнее давление, мм.рт.ст. | Нижнее давление, мм.рт.ст. |
  "$c"+---+-----------------------------------+-----------------------------+----------------------------+
  "$m"| 1 |      Гипотония (пониженное)       |          ниже 100           |          ниже 60           |
  "$g"| 2 |       Оптимальное давление        |          100 - 119          |          60 - 79           |
  "$g"| 3 |       Нормальное давление         |          120 - 129          |          80 - 84           |
  "$y"| 4 |    Высокое нормальное давление    |          130 - 139          |          85 - 89           |
  "$r"| 5 |   Умеренная гипертония (мягкая)   |          140 - 159          |          90 - 99           |
  "$r"| 6 |    Гипертония средней тяжести     |          160 - 179          |          100 - 109         |
  "$r"| 7 |        Тяжелая гипертония         |          более 180          |          более 110         |
  "$c"+---+-----------------------------------+-----------------------------+----------------------------+
  "$n""
}

function normal() {
  cat << EOF
  +---+-----------------------------------+-----------------------------+----------------------------+
  | № | Артериальное давление (категория) | Верхнее давление, мм.рт.ст. | Нижнее давление, мм.рт.ст. |
  +---+-----------------------------------+-----------------------------+----------------------------+
  | 1 |      Гипотония (пониженное)       |          ниже 100           |          ниже 60           |
  | 2 |       Оптимальное давление        |          100 - 119          |          60 - 79           |
  | 3 |       Нормальное давление         |          120 - 129          |          80 - 84           |
  | 4 |    Высокое нормальное давление    |          130 - 139          |          85 - 89           |
  | 5 |   Умеренная гипертония (мягкая)   |          140 - 159          |          90 - 99           |
  | 6 |    Гипертония средней тяжести     |          160 - 179          |          100 - 109         |
  | 7 |        Тяжелая гипертония         |          более 180          |          более 110         |
  +---+-----------------------------------+-----------------------------+----------------------------+
EOF
}

color
# normal

