#!/bin/bash
# Вариант циклического запуска программы sl и ее остановки по нажатию определенной клавиши

# Функция, которая будет выводить sl и ожидать нажатия клавиши
run_sl() {
    # Запускаем sl в фоновом режиме
    sl -ae &
    # Сохраняем PID процесса sl
    SL_PID=$!
    # Ждем, пока процесс sl завершится
    wait $SL_PID
}

# Основной цикл
while true; do
    # Выводим сообщение с предложением нажать клавишу
    # echo "Нажмите 'q' для завершения скрипта"
    # Запускаем sl вместе с ожиданием ввода от пользователя
    # Ожидаем ввода в течение 0.1 секунды
    read -rsn1 -t 0.01 key
    # Если строка, содержащая все нажатые клавиши, содержит "q", завершаем выполнение скрипта
    if [[ "$key" == *"q"* ]]; then
        # echo "Вы нажали клавишу 'q'. Завершаем выполнение скрипта."
        break
    fi
    # Запускаем команду sl
    run_sl
done

